{
  "entries": [
    {
      "id": 1,
      "date": "2019-07-09",
      "conceptsCovered": "Group Projects",
      "entryMessage": "Learned a lot about working in a group. Plan, Plan Plan. Have clear and concise goals. Also, have a reach goal and a minimum viable product goal.",
      "mood": "happy"
    },
    {
      "id": 2,
      "date": "2019-07-10",
      "conceptsCovered": "Using the Debugger",
      "entryMessage": "The debugger is very useful. Creating a flag to pause code to see what something is at that point in time is awesome!!!",
      "mood": "happy"
    },
    {
      "id": 3,
      "date": "2019-07-11",
      "conceptsCovered": "Manipulating the DOM",
      "entryMessage": "Learned about foreach loops, navigating through objects and looping through arrays.",
      "mood": "sad"
    },
    {
      "id": 4,
      "date": "2019-07-12",
      "conceptsCovered": "Manipulating the DOM and Objects",
      "entryMessage": "Learned about foreach loops, changing elements' classes using JS DOM manipulation, navigating through objects and looping through arrays",
      "mood": "okay"
    },
    {
      "id": 5,
      "date": "2019-07-31",
      "conceptsCovered": "Factory Functions",
      "entryMessage": "My brain hurt from making my Tic-Tac-Toe game work, but I learned about removeEventListener() and that if you pass in the true boolean it Removes the event handler from the capturing phase. Also, I learned about factory functions and how they return objects.",
      "mood": "happy"
    },
    {
      "id": 6,
      "date": "2019-08-02",
      "conceptsCovered": "Array Methods",
      "entryMessage": "Array methods are super powerful, but complex to understand how they work. For instance the sort method is able to do a bubble sort with one line of code!",
      "mood": "okay"
    },
    {
      "id": 7,
      "date": "2019-08-05",
      "conceptsCovered": "More Array Methods and Map Objects",
      "entryMessage": "Chaining array methods is awesome. It can be confusing, but it is so powerful. Also, I learned about the Map object which is a powerful tool that can be used for hash map searches.",
      "mood": "happy"
    },
    {
      "id": 8,
      "date": "2019-08-06",
      "conceptsCovered": "More on API's and Session Storage",
      "entryMessage": "Worked with our API to delete journal entries, filter data by mood and re-rendering that information to the DOM. Also, session/local storage are great ways to prevent unnecessary fetching of data, but I was not able to get it to completely work.",
      "mood": "okay"
    },
    {
      "date": "2019-08-09",
      "conceptsCovered": "Edit Functionality",
      "entryMessage": "Completed Edit functionality on my journal, but I learned very quickly that when you have more than one source of data that you are managing it becomes very difficult to keep track of at different points in your application",
      "mood": "okay",
      "id": 9
    }
  ]
}